tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# General-purpose scripting language
brew "php"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# HTTP regression testing and benchmarking utility
brew "siege"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# Password manager that keeps all passwords secure behind one password
cask "1password"
cask "1password-cli"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Reimagine your terminal
cask "fig"
# A typeface made for developers by JetBrains
cask "font-jetbrains-mono"
# Tools to protect your emails and files
cask "gpg-suite"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# App to write, plan, collaborate, and get organized
cask "notion"
# OpenVPN Connect client
cask "openvpn-connect"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# File transfer application
cask "transmit"
