tap "homebrew/bundle"
tap "homebrew/services"

# Static checker for GitHub Actions workflow files
brew "actionlint"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# Perl compatible regular expressions library
brew "pcre"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# General-purpose scripting language
brew "php"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# HTTP regression testing and benchmarking utility
brew "siege"
# Utility-first CSS framework
brew "tailwindcss"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"

# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# A typeface made for developers by JetBrains
cask "font-jetbrains-mono"
# Tools to protect your emails and files
cask "gpg-suite"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Online collaborative whiteboard platform
cask "miro"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# File transfer application
cask "transmit"
# Free and open source AI image upscaler
cask "upscayl"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Rust-based terminal
cask "warp"
